//=================================================================================
// Реализация контроллера Ethernet на основе приемо-передатчика RTL8211EG
//---------------------------------------------------------------------------------
// Модуль MAC адреса
//=================================================================================
module small_rom
#(parameter FILE = "../../hdl/deqnap/sarom.txt")
(
	output [63:0]	q
);

reg  [7:0]	mem[7:0];
assign q = {mem[7], mem[6], mem[5], mem[4], mem[3], mem[2], mem[1], mem[0]};

initial begin
   $readmemh(FILE, mem);
end

endmodule
